posts/2021-03-11-emacs-snippets.org
#+title: Emacs Snippets
#+date: <2021-03-11 18:04>
#+filetags: emacs

* Operating file
** Dired sort by Date
   - C-u-s tr RET
** Dired Edit Mode
   - C-x C-q to turn dired into editing mode
   - M-% (if you want replace text in dired buffer)
   - C-c C-c to exit editing mode (or use C-c ESC drop change)
* Edit text     
** Replace Text
- M-% text RET
** Emacs Column edit
   - C-x SPC (select region)
   - C-x rt (replace select region) RET
   - C-x rd (remove select region) RET
* Remote
** How to use tramp?
   - C-x C-f /sshx:192.168.1.1: RET username RET password RET (I don't know why ssh not work)

