2021-03-11-emacs-snippets.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://keke-cute.github.io/rss.xml"
      title="RSS feed for https://keke-cute.github.io/">
<title>Emacs Snippets</title>
<meta name="author" content="keke">
<meta name="referrer" content="no-referrer">
<link href= "static/blog.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="static/favicon.ico"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://keke-cute.github.io">Home</a>  <A href="https://keke-cute.github.io/emacs.html">Emacs</a>
</div></div>
<div id="content">
<div class="post-date">11 Mar 2021</div><h1 class="post-title"><a href="https://keke-cute.github.io/2021-03-11-emacs-snippets.html">Emacs Snippets</a></h1>

<div id="outline-container-orgb3b6e82" class="outline-2">
<h2 id="orgb3b6e82">Operating file</h2>
<div class="outline-text-2" id="text-orgb3b6e82">
</div>
<div id="outline-container-orgdda691f" class="outline-3">
<h3 id="orgdda691f">Dired sort by Date</h3>
<div class="outline-text-3" id="text-orgdda691f">
<ul class="org-ul">
<li>C-u-s tr RET</li>
</ul>
</div>
</div>
<div id="outline-container-orgbd4b406" class="outline-3">
<h3 id="orgbd4b406">Dired Edit Mode</h3>
<div class="outline-text-3" id="text-orgbd4b406">
<ul class="org-ul">
<li>C-x C-q to turn dired into editing mode</li>
<li>M-% (if you want replace text in dired buffer)</li>
<li>C-c C-c to exit editing mode (or use C-c ESC drop change)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge64a23a" class="outline-2">
<h2 id="orge64a23a">Edit text</h2>
<div class="outline-text-2" id="text-orge64a23a">
</div>
<div id="outline-container-org483de4e" class="outline-3">
<h3 id="org483de4e">Emacs Column edit</h3>
<div class="outline-text-3" id="text-org483de4e">
<ul class="org-ul">
<li>C-x SPC (select region)</li>
<li>C-x rt (replace select region) RET</li>
<li>C-x rd (remove select region) RET</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd136ec4" class="outline-2">
<h2 id="orgd136ec4">Remote</h2>
<div class="outline-text-2" id="text-orgd136ec4">
</div>
<div id="outline-container-org8890bd7" class="outline-3">
<h3 id="org8890bd7">How to use tramp?</h3>
<div class="outline-text-3" id="text-org8890bd7">
<ul class="org-ul">
<li>C-x C-f /sshx:192.168.1.1: RET username RET password RET (I don't know why ssh not work)</li>
</ul>
</div>
</div>
</div>
<div class="taglist"><a href="https://keke-cute.github.io/tags.html">Tags</a>: <a href="https://keke-cute.github.io/tag-emacs.html">emacs</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
